Repository: ssterling/varlpenis
Catalog: src/po/*.po
Languages: fr, hu, ja

source: -c output color
fr: -c sortir en couleur
ja: -c カラーで出力する

source: -e num set length of semen string
fr: -e num fixer la longueur du sperme
ja: -e num 精液の長さを設定する

source: -f output fullwidth characters
fr: -f sortir des caractères pleine chasse
ja: -f 全角で出力する

source: -h show this message
fr: -h afficher ce message
ja: -h このヘルプ情報を表示する

source: -l num set length of shaft
fr: -l num fixer la longueur du corps
ja: -l num シャフトの長さを設定する

source: -v show copyright and version info
fr: -v afficher informations de copyright et version
ja: -v 著作権とバージョン情報を表示する

source: Error: argument to option `-%c' is too large (above `UINT_MAX').
fr: Erreur : le paramètre de l'option `-%c' est trop grand (plus de `UINT_MAX')
ja: エラー：`-%c'の値は大きすぎます（>UINT_MAX）

source: Error: argument to option `-%c' must be a positive integer
fr: Erreur : le paramètre de l'option `-%c' doit être un entier positif
ja: エラー：`-%c'の値は正整数でなればいけません

source: Error: argument to option `-%c' must be zero or a positive integer
fr: Erreur : le paramètre de l'option `-%c' doit être zéro ou un entier positif
ja: エラー：`-%c'の値は0・正整数でなればいけません

source: Error: bogus error code received from options parser
fr: Erreur : faux code d'erreur de l'analyseur a été reçu
hu: Hiba: hamis hiba kód érkezett az opciók parszerjétől
ja: エラー：引数構文解析器から変なエラーコードである

source: Error: option `-%c' requires a positive integer as an argument
fr: Erreur : l'option `-%c' nécessite un paramètre qui est un entier positif
ja: エラー：`-%c'は正整数が必要です

source: Error: unknown option `-%c'
fr: Erreur : option inconnue `-%c'
ja: エラー：`-%c'は不明なオプションです

source: Error: unknown option char `\x%x'
fr: Erreur : caractère d'option inconnu `\x%x'
ja: エラー：`\x%x'は不明なオプション文字です

source: Generate an ASCII-art penis of arbitrary length
fr: Générer de l'ASCII-art de n'importe quelle longeur
hu: Tetszőleges hosszú ASCII pénisz generálása
ja: ASCII-artの陰茎を生成します

source: usage: %s [options] options:
fr: usage : %s [options] les options:
hu: használat: %s [opciók] opciók:
ja: 使用法：%s [オプション] オプションは以下の通りです：

source: Error: option `%c%c' requires a positive integer as an argument
hu: Hiba: `%c%c' opció elvár egy pozitív egész számot mint érték

source: Error: argument to option `%c%c' must be a positive integer
hu: Hiba: az értéknek pozitív egész számnak kell lennie `%c%c' opcióhoz

source: Error: argument to option `%c%c' must be zero or a positive integer
hu: Hiba: az értéknek nullának vagy pozitív egész számnak kell lennie `%c%c' opcióhoz

source: Error: argument to option `%c%c' is too large (above `UINT_MAX').
hu: Hiba: a megadott érték `%c%c' túl nagy (`UINT_MAX' fölött).

source: Error: unknown option `%c%c'
hu: Hiba: ismeretlen opció `%c%c'

source: Error: unknown option char `\x%X'
hu: Hiba: ismeretlen opció karakter `\x%X'

source: %cc output color
hu: %cc kimeneti szín

source: %ce num set length of semen string
hu: %ce num sperma string hosszának beállítása

source: %cf output fullwidth characters
hu: %cf teljes szélességű (fullwidth) karakterekkel jelenítse meg

source: %ch show this message
hu: %ch segítség megjelenítése (ez az üzenet)

source: %cl num set length of shaft
hu: %cl num test hossz beállítása

source: %cv show copyright and version info
hu: %cv szerzői jogok és verzió információ mutatása
